# PastePartsWithInvalidService Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SystemsFailures..::..PastePartsWithInvalidService Property
BuiltInFailures..::..SystemsFailures Class See Also
---
Parts were not pasted because fabrication configuration is not available or service is not valid in the type properties for the system.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PastePartsWithInvalidService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PastePartsWithInvalidService As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PastePartsWithInvalidService {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SystemsFailures Class
Autodesk.Revit.DB Namespace